[
    {
        "title": "Francesinha",
        "category": "Portuguesa",
        "image_path": "./img/francesinha.jpg",
        "difficulty": 2,
        "ingredients": [
            "bife de vaca",
            "queijo",
            "pão de forma",
            "salsicha",
            "linguiça",
            "fiambre",
            "sal",
            "pimenta"
        ],
        "quantity": [
            "2",
            "8 fatias",
            "6 fatias",
            "2",
            "2",
            "2 fatias",
            "q.b",
            "q.b"
        ],
        "time": 45,
        "portions": 2,
        "rating": 5,
        "steps": [
            "Cortar as salsichas ao meio e cortar novamente as metades, temperando de seguida com sal e pimenta. Cortar as linguiças de igual modo. Temperar os bifes com sal e pimenta, q.b, grelhando tudo de seguida.",
            "Torrar ligeiramente as fatias de pão, cobrindo depois com uma fatia de fiambre. Juntar por cima o bife e colocar então outra fatia de pão por cima. Adicionar a salsicha e a linguiça, cobrir com queijo e finalizar com a última fatia de pão. Cobrir tudo com 3 fatias de queijo e levar ao forno a 200ºC até derreter. Regar com molho de francesinha."
        ],
        "preview": "Prato típico do Porto para quem tem saudades de uma iguaria nacional.",
        "imagem": "https://www.google.com/search?q=francesinha&client=firefox-b-d&sxsrf=ALeKk03HZTAW7EjEJiy5dqN4HIAVTidwZQ:1589290807782&source=lnms&tbm=isch&sa=X&ved=2ahUKEwiB86rQua7pAhW6AGMBHbtUDggQ_AUoAXoECBIQAw&biw=766&bih=759#imgrc=s72OBnJfMTB_1M"
    },
    {
        "title": "Almôndegas de Soja c/ molho de tomate",
        "category": "Vegetariano",
        "image_path": "./img/meatball.jpg",
        "difficulty": 3,
        "ingredients": [
            "azeite",
            "alho",
            "cebola",
            "fermento",
            "pão ralado",
            "farinha",
            "soja granulada",
            "salsa",
            "orégãos",
            "sal",
            "tomate",
            "açúcar",
            "manjericão",
            "massa"
        ],
        "quantity": [
            "5 c. sopa",
            "1 dente",
            "1",
            "1/4 c. chá",
            "1/4 chávena + 2 c. sopa",
            "1/4 chávena + 2 c. sopa",
            "3/4 chávena",
            "3 c. sopa",
            "q.b",
            "q.b",
            "3",
            "1 c. sopa",
            "1 c. chá",
            "q.b"
        ],
        "time": 20,
        "portions": 8,
        "rating": 4.8,
        "steps": [
            "Preparar uma panela para colocar ao lume, com um cesto de cozinhar a vapor.",
            "Demolhar a soja durante 4min.",
            "Escorrer bem a água da soja e reservar.",
            "Numa sertã, adicionar azeite, alho e cebola picados, mexer até ficar dourado.",
            "Numa taça, misturar a soja com pão ralado, adicionar as ervas a gosto, sal, 3 colheres de sopa de azeite, a cebola e alho que alourou, a farinha e fermento. Misturar bem, podendo ser necessário amassar com as mãos.",
            "Dividir a massa, dar a forma de almôndegas e, quando a água da panela (passo 1) estiver a ferver, cozer as almôndegas a vapor durante 15 minutos.",
            "Para o molho, saltear novamente cebola com alho, adicionar as almôndegas já cozinhadas. Mexer sempre.",
            "Adicionar então tomate cortado, sal, um pouco de açúcar e as ervas aromáticas. Deixar apurar durante uns minutos.",
            "Servir com massa."
        ],
        "preview": "Uma boa maneira de incorporar proteína na dieta de qualquer pessoa, bastante saboroso e animal friendly!",
        "imagem": "https://www.google.com/search?q=almondegas+de+soja+com+massa&client=firefox-b-d&sxsrf=ALeKk016oZ8sKKtUxkLvSIwvvCWswyXgDw:1589290733348&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjd-Ousua7pAhUvBGMBHQrjDOsQ_AUoAXoECAwQAw&biw=766&bih=759#imgrc=BjUUcYPdaDb4rM"
    },
    {
        "title": "Bolo de Chocolate em Caneca",
        "category": "Doces",
        "image_path": "./img/cake.PNG",
        "difficulty": 1,
        "ingredients": [
            "ovo",
            "açúcar",
            "óleo",
            "farinha",
            "leite meio-gordo",
            "chocolate em pó",
            "fermento em pó"
        ],
        "quantity": [
            "1",
            "1 c. sopa",
            "3 c. sopa",
            "4 c. sopa",
            "4 c. sopa",
            "4 c. sopa",
            "1 c. chá"
        ],
        "time": 5,
        "portions": 1,
        "rating": 4.7,
        "steps": [
            "Numa caneca bater um ovo. Juntar o óleo, açúcar e leite e mexer até ficar homogéneo.",
            "Numa taça à parte, misturar a farinha, o fermento e o chocolate.",
            "Adicionar a mistura seca à caneca, lentamente, mexendo bem.",
            "Levar ao microondas durante 3 minutos, potência máxima.",
            "Servir diretamente na caneca."
        ],
        "preview": "Para os dias em que apetece um doce e não tem nada em casa.",
        "imagem": "https://www.pingodoce.pt/receitas/bolo-de-caneca/"
    },
    {
        "title": "Bacalhau com Natas",
        "category": "Tradicional",
        "image_path": "./img/bacalhau.jpg",
        "difficulty": 4,
        "ingredients": [
            "batata",
            "azeite",
            "bacalhau",
            "manteiga",
            "farinha",
            "leite meio-gordo",
            "natas",
            "sal",
            "noz-moscada",
            "pimenta",
            "limão",
            "alho",
            "cebelha"
        ],
        "quantity": [
            "500 g",
            "125 ml",
            "400 g",
            "40 g",
            "40 g",
            "250 ml",
            "250 ml",
            "1 c. sopa",
            "1 c. sopa",
            "q.b",
            "q.b",
            "3 dentes",
            "2"
        ],
        "time": 45,
        "portions": 4,
        "rating": 4.5,
        "steps": [
            "Pré-aquecer o forno a 220ºC",
            "Cortar as batatas em cubos e fritar em azeite.",
            "Colocar o bacalhau num tacho e cobrir com água. Levar a cozinhar em lume alto; ao levantar fervura, baixar o lume e deixar por 5 min.",
            "Retirar o bacalhau da água e reservar 200 ml da água de cozedura. Deixar arrefecer o bacaulhau, retirar as peles e espinhas, de seguida desfiar.",
            "Levar um tacho ao lume e colocar a manteiga a derreter. Juntar a farinha e mexer bem, juntar lentamente os 200 ml da água que guardou, o leite e as natas.",
            "Quando começar a ferver, temperar com sal, pimenta, noz-moscada e algumas gotas de limão. Envolver todos os ingredientes.",
            "Noutro tacho, colocar 100 ml de aeite e deixar refogar as cebolas, alhos e uma folha de louro. Adicionar o bacalhau, mexer e deixar refogar.",
            "Juntar as batatas e envolva bem. Acrescentar então 2/3 do molho béchamel, mexer bem e retirar do lume.",
            "Pincelar um tabuleiro de forno com o restante azeite, passando então o preparado de bacalhau para o mesmo. Colocar por cima o resto do molho béchamel.",
            "Levar o tabuleiro ao forno para gratinar durante 15/20 minutos."
        ],
        "preview": "Um típico prato português para quem está com saudades dos cozinhados da avó.",
        "imagem": "https://www.pingodoce.pt/receitas/bacalhau-com-natas/"
    },
    {
        "title": "Arroz de Marisco",
        "category": "Mediterrâneo",
        "image_path": "./img/marisco.jpg",
        "difficulty": 4,
        "ingredients": [
            "marisco variado",
            "cebola",
            "alho",
            "azeite",
            "tomate",
            "coentros",
            "água",
            "sal",
            "arroz",
            "limão"
        ],
        "quantity": [
            "800 g",
            "200 g",
            "300 g",
            "3 c. sopa",
            "750 g",
            "q.b",
            "1 l",
            "1 c. sopa",
            "250 g",
            "1/2"
        ],
        "time": 50,
        "portions": 4,
        "rating": 4.3,
        "steps": [
            "Retire as delícias do mar do preparado de marisco e reserve-as. Pique a cebola e corte o alho-francês em rodelas. Aqueça o azeite num tacho, junte a cebola e o alho-francês e deixe cozinhar cerca de 5 minutos ou até começarem a alourar.",
            "Lave o tomate, limpe-o de sementes e corte-o em pedaços. Pique os pés de um molho de coentros. Junte o tomate e os pés dos coentros picados aos legumes, tape e cozinhe em lume brando cerca de 10 minutos.",
            " Noutro tacho, ferva a água temperada com o sal e introduza o preparado de mariscos. Deixe ferver 2 minutos e coe os mariscos.",
            "Deite o caldo da cozedura sobre os legumes, mexa e assim que retomar fervura, introduza o arroz. Volte a mexer e cozinhe, tapado e em lume moderado a brando, durante 15 minutos.",
            "Retire os camarões com casca, os mexilhões e as amêijoas e junte-os às delícias do mar reservadas. Adicione os restantes mariscos ao arroz no final da cozedura, mexa e retire do lume.",
            "Junte uma mão-cheia de folhas de coentros e regue com o sumo do limão. Enfeite com os mariscos reservados e sirva de imediato."
        ],
        "preview": "Com apenas oito ingredientes este arroz de marisco é cremoso, saboroso e fácil de fazer.",
        "imagem": "https://www.pingodoce.pt/receitas/arroz-de-marisco/"
    },
    {
        "title": "Frango com limão e orégãos",
        "category": "Portuguesa",
        "image_path": "./img/frangolimao.jpg",
        "difficulty": 4,
        "ingredients": [
            "coxas de frango",
            "sal",
            "pimenta",
            "limão",
            "alho",
            "cenoura",
            "cebola",
            "orégãos",
            "vinho branco",
            "azeite",
            "cuscuz"
        ],
        "quantity": [
            "2",
            "q.b",
            "q.b",
            "2",
            "6 dentes",
            "4",
            "4",
            "q.b",
            "1.5 dl",
            "4 c. sopa",
            "200 g"
        ],
        "time": 45,
        "portions": 1,
        "rating": 4.9,
        "steps": [
            "Pré-aqueça o forno a 190º C.",
            "Tempere as coxas de frango com a colher de sobremesa de sal e um pouco de pimenta e regue-as com o sumo de um limão. Reserve.",
            "Corte o outro limão em fatias e disponha-as num tabuleiro de forno.",
            " Coloque por cima as coxas de frango e espalhe os dentes de alho esmagados.",
            "Descasque as cenouras e corte-as em palitos. Reserve.",
            "Corte as cebolas descascadas em meias-luas grossas e disponha-as à volta do frango, juntamente com as cenouras.",
            "Polvilhe com folhas de orégãos, regue com o vinho branco e o azeite e leve ao forno cerca de 30 minutos. Regue com um pouco de água se necessário.",
            "Prepare o cuscuz conforme as instruções da embalagem, usando o restante sal para temperar.",
            "Sirva a acompanhar o frango e os legumes."
        ],
        "preview": "O bom de preparar uma receita no forno, é deixar que todos os ingredientes cozinhem ao mesmo tempo, num só tabuleiro. Em apenas 30 minutos tenha prontas a servir umas deliciosas coxas de frango!",
        "imagem": "https://www.pingodoce.pt/receitas/frango-com-limao/"
    },
    {
        "title": "Sushi de Banana",
        "category": "Doces",
        "image_path": "./img/sushi.jpg",
        "difficulty": 1,
        "ingredients": [
            "banana",
            "limão",
            "chocolate preto",
            "morango",
            "coco ralado",
            "manteiga de amendoim",
            "granola"
        ],
        "quantity": [
            "3",
            "1",
            "200 g",
            "3",
            "1 c. sopa",
            "1 c. sopa",
            "2 c. sopa"
        ],
        "time": 15,
        "portions": 2,
        "rating": 4.8,
        "steps": [
            "Descasque as bananas e regue-as com o sumo de limão.",
            "Derreta o chocolate no microondas.",
            "Cubra duas das bananas com o chocolate derretido. Polvilhe uma delas com os morangos, previamente triturados, e a outra com o coco ralado.",
            " Barre a terceira banana com a manteiga de amendoim e polvilhe com a granola.",
            "Leve ao frio até servir.",
            " Antes de servir, corte as bananas em fatias para obter a forma de sushi."
        ],
        "preview": "Uma forma divertida de apresentar bananas!",
        "imagem": "https://www.pingodoce.pt/receitas/sushi-de-banana/"
    },
    {
        "title": "Arroz de Pato",
        "category": "Tradicional",
        "image_path": "./img/pato.jpg",
        "difficulty": 5,
        "ingredients": [
            "água",
            "vinho tinto",
            "chouriço",
            "toucinho",
            "louro",
            "peito de pato",
            "sal",
            "azeite",
            "cebola",
            "alho",
            "polpa de tomate",
            "arroz agulha",
            "pimenta preta",
            "colorau"
        ],
        "quantity": [
            "1,5 l",
            "100 ml",
            "150 g",
            "150 g",
            "2 folhas",
            "4",
            "1 c. chá",
            "50 ml",
            "1",
            "3 dentes",
            "1 c. sopa",
            "400 g",
            "q.b",
            "q.b"
        ],
        "time": 80,
        "portions": 4,
        "rating": 4,
        "steps": [
            "Num tacho, coloque o litro e meio de água, o vinho tinto, metade do chouriço, o toucinho fumado, as folhas de louro, os peitos de pato e o sal.",
            "Deixe cozer durante 40 minutos.",
            "Coe e reserve o caldo da cozedura do pato.",
            " Num tacho, faça um refogado com o azeite, a cebola picada e o alho picado. Deixe alourar 3 minutos e junte a polpa de tomate.",
            "Deixe apurar durante 5 minutos.",
            "Deixe arrefecer as carnes, desfie o pato e corte o chouriço e o toucinho fumado aos cubos. Junte ao tacho do refogado.",
            "Adicione um pouco do caldo e deixe apurar durante 3 minutos.",
            "Junte o arroz e misture bem. Depois adicione 400 ml do caldo da cozedura, a pimenta e o colorau. Quando levantar fervura baixe o lume e deixe cozer durante 10 minutos.",
            " Coloque o arroz num tabuleiro de ir ao forno. Corte o restante chouriço às rodelas e decore por cima do arroz.",
            "Leve ao forno a 170º C durante 15 minutos até alourar."
        ],
        "preview": "Um arroz de pato é sempre uma boa ideia para uma festa ou para um encontro com amigos. Aprenda a fazê-lo com quem sabe. Sai sempre bem.",
        "imagem": "https://www.pingodoce.pt/receitas/arroz-de-pato/"
    },
    {
        "title": "Salada de grão com atum",
        "category": "Saladas",
        "image_path": "./img/graoeatum.jpg",
        "difficulty": 3,
        "ingredients": [
            "ovo",
            "sal",
            "grão",
            "brócolo",
            "cebola roxa",
            "pimentos",
            "atum em lata",
            "pimenta",
            "azeite",
            "vinagre",
            "salsa"
        ],
        "quantity": [
            "2",
            "1 c. sobremesa",
            "850 g",
            "250 g",
            "70 g",
            "100 g",
            "2",
            "q.b",
            "2 c. sopa",
            "2 c. sopa",
            "2 c. sopa"
        ],
        "time": 25,
        "portions": 2,
        "rating": 3.8,
        "steps": [
            " Coloque os ovos num tacho com água e o sal.",
            "Escorra o grão, depois de cozido, num coador e passe-o por água. Adicione aos ovos e deixe ferver durante 10 minutos.",
            "Coloque os brócolos lavados num recipiente que possa ir ao microondas.",
            "Tape-o e cozinhe durante 5 minutos na potência máxima, mexendo a meio da confecção.",
            "Descasque e pique a cebola e a salsa finamente.",
            "Lave os pimentos, retire as sementes e corte-os em tiras. Escorra o atum, desfaça-o em pedaços e misture-o com a cebola picada e as tiras de pimento.",
            " Adicione o grão e os brócolos, tempere com pimenta, regue com o azeite e o vinagre e adicione a salsa.",
            "Misture e enfeite com os ovos cozidos cortados em gomos ou às rodelas.",
            "Sirva de imediato."
        ],
        "preview": "Uma receita prática, fresca e saudável. A prova de que é possível preparar um prato com os melhores sabores portugueses, em apenas 10 minutos.",
        "imagem": "https://www.pingodoce.pt/receitas/salada-morna-de-grao-com-atum/"
    },
    {
        "title": "Panquecas",
        "category": "Doces",
        "image_path": "./img/panquecas.jpg",
        "difficulty": 1,
        "ingredients": [
            "farinha",
            "açúcar",
            "fermento em pó",
            "sal",
            "ovo",
            "leite meio-gordo",
            "manteiga"
        ],
        "quantity": [
            "150 g",
            "50 g",
            "1 c. chá",
            "1/2 c. chá",
            "1",
            "200 ml",
            "2 c. sopa"
        ],
        "time": 15,
        "portions": 6,
        "rating": 4.6,
        "steps": [
            "Numa taça, misture a farinha, o açúcar, o fermento, o sal, o ovo e o leite. Bata bem com uma vara de arames para que fique sem grumos.",
            "Numa frigideira antiaderente e em lume brando, derreta a manteiga. Verta uma colher de sopa de massa na frigideira e espalhe ligeiramente a massa.",
            " Quando a parte de cima da panqueca começar a ficar com pequenas bolhas, pode virá-la com a ajuda de uma espátula. Repita o processo até acabar a massa, adicionando sempre que necessário manteiga na frigideira.",
            " Sirva as panquecas acabadas de fazer com mel e frutos vermelhos."
        ],
        "preview": "Deliciosa maneira de fazer um lanche fora do normal e adoçar o gosto!",
        "imagem": "https://www.pingodoce.pt/receitas/panquecas/"
    },
    {
        "title": "Salada fria de massa com salmão",
        "category": "Saladas",
        "image_path": "./img/saladamassasalmao.jpg",
        "difficulty": 3,
        "ingredients": [
            "salmão",
            "sal",
            "pimenta",
            "alho em pó",
            "limão",
            "cenoura",
            "azeite",
            "courgette",
            "cogumelo",
            "massa",
            "espinafre",
            "ananás",
            "funcho em rama"
        ],
        "quantity": [
            "2 postas",
            "1 c. chá",
            "q.b",
            "1 c. café",
            "1/2",
            "150 g",
            "2 c. sopa",
            "150 g",
            "250 g",
            "250 g",
            "250 g",
            "150 g",
            "100 g",
            "q.b"
        ],
        "time": 35,
        "portions": 2,
        "rating": 4.9,
        "steps": [
            " Tempere os lombos de salmão descongelados com 1 colher de chá de sal, pimenta moída na altura, alho em pó, a raspa da casca do limão e o sumo de meio limão. Deixe marinar enquanto prepara os restantes ingredientes.",
            " Ponha um tacho ao lume com água para cozinhar a massa.",
            "Pele a cenoura e corte-a em meias rodelas finas. Elimine os topos da courgette e corte-a também em meias rodelas. Aqueça 1 colher de sopa de azeite numa frigideira antiaderente e adicione a cenoura e a courgette cortadas.",
            "Pele a cenoura e corte-a em meias rodelas finas. Elimine os topos da courgette e corte-a também em meias rodelas. Aqueça 1 colher de sopa de azeite numa frigideira antiaderente e adicione a cenoura e a courgette cortadas.",
            "Limpe os cogumelos com papel de cozinha, rasgue-os em tiras e deite-os na frigideira. Deixe cozinhar sobre lume moderado, mexendo de vez em quando, durante 5 minutos ou até os legumes estarem tenros mas crocantes.",
            "Adicione a massa num tacho com água a ferver e previamente temperada com sal. Deixe ferver até estar al-dente.",
            "Escorra a massa, passe-a por água fria até arrefecer e coloque no recipiente onde vai ser servida. Regue com 1 colher de sopa de azeite e misture.",
            "Junte os espinafres aos legumes, mexa, retire do lume, junte-os à massa e misture. Adicione o abacaxi cortado em pequenos troços.",
            "Aqueça a frigideira onde cozinhou os legumes, adicione os lombos de salmão bem escorridos e aloure-os de ambos os lados sobre lume forte (não deixe cozinhar demasiado o salmão). Retire do lume, desfaça em lascas grossas, regue com sumo de limão e junte à salada."
        ],
        "preview": "Salmão de Verão é delicioso frio, principalmente em saladas como esta salada fria de massa com salmão, onde propomos uma mistura rica de legumes. No final, o abacaxi confere-lhe uma frescura sem igual. Uma receita simples e saudável.",
        "imagem": "https://www.pingodoce.pt/receitas/salada-fria-de-massa-com-salmao/"
    },
    {
        "title": "Lasanha",
        "category": "Italiana",
        "image_path": "./img/lasanha.jpg",
        "difficulty": 4,
        "ingredients": [
            "azeite",
            "cebola",
            "alho",
            "vitela",
            "vinho branco",
            "orégãos",
            "sal",
            "pimenta",
            "tomate",
            "polpa de tomate",
            "manteiga",
            "farinha",
            "leite meio gordo",
            "massa para lasanha",
            "mozzarela",
            "manjericão"
        ],
        "quantity": [
            "2 c. sopa",
            "1",
            "4 dentes",
            "500 g",
            "50 ml",
            "q.b",
            "1 c. chá",
            "q.b",
            "3",
            "100 ml",
            "80 g",
            "80 g",
            "400 ml",
            "12 folhas",
            "80 g",
            "2 c. sopa"
        ],
        "time": 50,
        "portions": 4,
        "rating": 4.7,
        "steps": [
            "Pré-aqueça o forno a 180º C.",
            "Num tacho, refogue em azeite a cebola e o alho picados. Junte a carne picada e deixe cozinhar durante 3 minutos em lume médio mexendo sempre.",
            "De seguida, refresque com o vinho branco e adicione os orégãos. Tempere com metade do sal e a pimenta.",
            " Junte o tomate picado e limpo de pele e grainhas juntamente com a polpa de tomate envolva.",
            " Deixe cozinhar durante 10 minutos em lume médio mexendo de vez em quando até secar um pouco o preparado. Tire do lume e reserve.",
            "Para o molho bechamel: derreta manteiga num tacho e logo de seguida adicione a farinha mexendo bem, até formar uma mistura sem grumos. Acrescente o leite aos poucos mexendo sempre e deixe cozinhar em lume brando até engrossar. Tempere com o restante sal e reserve.",
            "Num tabuleiro de forno quadrado coloque por camadas: as folhas de lasanha, o preparado da carne e o molho bechamel. Repita o processo, terminando com uma camada de folhas de lasanha.",
            " Polvilhe com queijo mozzarella e leve ao forno a 190º C durante 25 minutos.",
            "Sirva decorado com os raminhos de manjericão."
        ],
        "preview": "A lasanha é uma receita tipicamente italiana, feita com carne e molho de tomate sobre camadas de folhas de lasanha e molho bechamel. Uma refeição deliciosa para toda a família.",
        "imagem": "https://www.pingodoce.pt/receitas/lasanha/"
    },
    {
        "title": "Crepes com morango e chantilly",
        "category": "Doces",
        "image_path": "./img/crepesmorango.jpg",
        "difficulty": 1,
        "ingredients": [
            "morango",
            "chantilly",
            "farinha",
            "ovo",
            "leite",
            "óleo"
        ],
        "quantity": [
            "q.b",
            "q.b",
            "250 g",
            "4",
            "500 ml",
            "2 col. sopa"
        ],
        "time": 10,
        "portions": 15,
        "rating": 4,
        "steps": [
            "Misture a farinha e o sal num recipiente fundo. Faça um buraco no meio e coloque os ovos.",
            "Misture e junte o extrato de baunilha e o óleo. Se for demasiado duro de misturar, junte um pouco de leite.",
            "Depois, junte o leite pouco a pouco, misturando sempre. No fim, cubra o recipiente (só para proteger) e deixe repousar por 1 hora (na geladeira/frigorífico).",
            "Aquecer uma frigideira ou uma frigideira própria para crepes e untar de óleo com um papel de cozinha. Verter um pouco de massa dentro e deixar cozer por um minuto. Virar do avesso, cozer 1 minuto",
            "Recheie com açúcar em pó / de confeiteiro, doce, geleia, mel, chocolate para barrar, açúcar ou deixe assim mesmo. Bom Apetite!"
        ],
        "preview": "Uma deliciosa sobremesa para um almoço de domingo!",
        "imagem": "nao sei que por aqui"
    },
    {
        "title": "Gelados de melancia",
        "category": "Doces",
        "image_path": "./img/geleadosmelancia.jpg",
        "difficulty": 1,
        "ingredients": [
            "melancia",
            "leite condensado"
        ],
        "quantity": [
            "1 kg",
            "1 lata"
        ],
        "time": 15,
        "portions": 5,
        "rating": 4,
        "steps": [
            "Corte um quilo de melancia em cubos (de preferência sem sementes) e congele-os durante, pelo menos, quatro horas.",
            "Triture a melancia congelada, num liquidificador ou no robô de cozinha, juntamente com uma lata de leite condensado retirada do frigorífico e já está!"
        ],
        "preview": "Alternativa saúdável para os miúdos lá de casa!",
        "imagem": "nao sei que por aqui"
    },
    {
        "title": "Pizza com espinafres",
        "category": "Italiana",
        "image_path": "./img/pizza.jpg",
        "difficulty": 3.5,
        "ingredients": [
            "massa de pizza",
            "molho de tomate",
            "mozzarela",
            "azeite",
            "alho",
            "espinafre",
            "orégãos"
        ],
        "quantity": [
            "1 pc",
            "3 col. sopa",
            "80 g",
            "1 col. sopa",
            "1 dente",
            "2 embalagens",
            "q.b"
        ],
        "time": 50,
        "portions": 1,
        "rating": 3.5,
        "steps": [
            "Pré-aqueça o forno a 230˚ C.",
            "Estenda a massa num tabuleiro, previamente forrado com papel vegetal.",
            "Distribua o molho de tomate por cima da pizza, polvilhe com o queijo mozzarella ralado e leve ao forno cerca de 15 a 20 minutos.",
            "Coloque ao lume uma frigideira larga com o azeite e o alho picado e, quando estiver bem quente, introduza as folhas de espinafres. Deixe saltear até murcharem.",
            "Corte a mozzarella em rodelas.",
            "Distribua os espinafres e as rodelas de mozzarella pela superfície da pizza e polvilhe com orégãos."
        ],
        "preview": "Quem diria que não é preciso ir ao restaurante para se comer uma boa pizza?",
        "imagem": "nao sei que por aqui"
    },
    {
        "title": "Macarons",
        "category": "Doces",
        "image_path": "./img/macarons.jpg",
        "difficulty": 5,
        "ingredients": [
            "açúcar",
            "farinha de amêndoa",
            "clara de ovo",
            "açúcar em pó",
            "corante"
        ],
        "quantity": [
            "200 g",
            "150 g",
            "4",
            "90 g",
            "opcional"
        ],
        "time": 90,
        "portions": 10,
        "rating": 3.2,
        "steps": [
            "Coloque as claras e o açúcar em um panela no fogo baixo, até o açúcar dissolver. Só aqueça, não precisa ferver.",
            "Com uma batedeira, bata a mistura que aqueceu acima em claras em neve até formar um merengue.",
            "Coloque o corante e misture bem até a cor ficar homogênea.",
            "Passar pela peneira os ingredientes secos: farinha de amêndoas e açúcar de confeiteiro",
            "Junte os ingredientes secos e peneirados ao merengue de claras fazendo movimentos suaves. Sempre mexendo de baixo para cima e do centro para a borda do recipiente. Mexa bem até ficar uniforme, macia e brilhante.",
            "Coloque essa mistura em um saco de confeitar e corte a ponta",
            "Colocar uma folha de papel vegetal num tabuleiro de forno e faça bolas de aproximadamente 4cm de diametro com o saco de confeitar.",
            "Levar ao forno por 18 minutos a 180ºC sem pré-aquecer."
        ],
        "preview": "Um doce que custa a fazer mas se correr bem vale a pena!",
        "imagem": "nao sei que por aqui"
    },
    {
        "title": "Omolete de Espinafres e Tomate",
        "category": "Mediterrâneo",
        "image_path": "./img/omelete.jpg",
        "difficulty": 1,
        "ingredients": [
            "ovo",
            "espinafre",
            "tomate",
            "cebola",
            "sal",
            "pimenta",
            "azeite"
        ],
        "quantity": [
            "2",
            "1/2 chávena",
            "1",
            "1/4",
            "q.b",
            "q.b",
            "1 c. chá"
        ],
        "time": 15,
        "portions": 2,
        "rating": 4,
        "steps": [
            "Numa tigela mexa os ovos. Tempere com sal e pimenta.",
            "Descongele os espinafres no microondas, esprema o excesso de água e corte-os grosseiramente.",
            "Leve ao lume uma frigideira anti-aderente com o azeite. Coloque as rodelas de tomate numa única camada. Deixe alourar, vire e aloure do outro lado. Retire da frigideira e reserve.",
            "Na mesma frigideia coloque a cebola e os espinafres. Tempere com sal e pimenta. Cozinhe até a cebola estar translucida. Espalhe o tomate pela frigideira.",
            "Verta o ovo de forma a que se espalhe por toda a frigideira. Espalhe o queijo por cima do ovo.",
            "Cubra a frigideira com uma tampa, se tiver. Deixe cozinhar até o topo do ovo estar quase firme.",
            "Com a ajuda de uma espátula, dobre a omelete ao meio.",
            "Sirva com molho picante a gosto."
        ],
        "preview": "Melhor pequeno-almoço ou lanche!",
        "imagem": "nao sei que por aqui"
    }
]